# coding:utf8

daan = ["""党的十八大以来的五年，是党和国家发展进程中很不平凡的五年。五年来，以习近平同志为核心的党中央科学把握当今世界和当代中国发展大势，顺应实践要求和人民愿望，以巨大的政治勇气和强烈的责任担当，举旗定向、谋篇布局、迎难而上、开拓进取，统揽伟大斗争、伟大工程、伟大事业、伟大梦想，统筹推进“五位一体”总体布局、协调推进“四个全面”战略布局，推出一系列重大战略举措，出台一系列重大方针政策，推进一系列重大工作，取得了改革开放和社会主义现代化建设新的重大成就。
这是砥砺奋进的五年。我们全面加强党的领导，发挥党总揽全局、协调各方的领导核心作用，党的凝聚力、战斗力和领导力、号召力大大增强。我们坚定不移贯彻新发展理念，不断适应、把握、引领经济发展新常态，深入推进供给侧结构性改革，有力推动我国发展不断朝着更高质量、更有效率、更加公平、更可持续的方向前进。我们坚定不移全面深化改革，国家治理体系中具有四梁八柱性质的改革主体框架已经基本确立，重要领域和关键环节大批改革举措密集出台，改革落实力度持续加大，改革呈现全面发力、多点突破、纵深推进的崭新局面。我们坚定不移全面推进依法治国，科学立法、严格执法、公正司法、全民守法进程统筹推进，我们党运用法律手段领导和治理国家的能力显著增强。我们加强党对意识形态工作的领导，旗帜鲜明巩固马克思主义在意识形态领域的指导地位，意识形态领域方向性、根本性、全局性问题得到明确，全党全社会思想上的团结统一更加巩固。我们坚定不移推进生态文明建设，把推动形成绿色发展方式和生活方式摆在更加突出的位置，“绿水青山就是金山银山”的发展理念深入人心，美丽中国建设迈出重要步伐。我们坚定不移推进国防和军队现代化，以党在新形势下的强军目标为引领，深入推进政治建军、改革强军、科技兴军、依法治军，国防和军队改革取得历史性突破。我们坚定不移推进中国特色大国外交，推动构建以合作共赢为核心的新型国际关系，致力于打造人类命运共同体，赢得了国际社会广泛认同，营造了我国发展的和平国际环境和良好周边环境。我们坚定不移推进全面从严治党，着力解决人民群众反映最强烈、对党的执政基础威胁最大的突出问题，形成了反腐败斗争压倒性态势，党内政治生活气象更新，全党理想信念更加坚定、党性更加坚强，党自我净化、自我完善、自我革新、自我提高能力显著提高，党的执政基础和群众基础更加巩固，为党和国家各项事业发展提供了坚强政治保证。
五年来党和国家事业取得的历史性成就和发生的历史性变革，在新中国成立特别是改革开放以来我国发展取得的重大成就基础上，把中国特色社会主义推进到新的发展阶段。五年来我们之所以能取得历史性成就、发生历史性变革，最根本的是我们党有以习近平同志为核心的党中央的坚强领导，有习近平总书记系列重要讲话精神和治国理政新理念新思想新战略的科学指引。学习贯彻习近平总书记“7·26”重要讲话精神，要紧密联系党和人民过去五年砥砺奋进的伟大实践，加深对历史性成就和变革的理解，进一步增强政治意识、大局意识、核心意识、看齐意识，增强维护核心、保持一致的思想自觉和行动自觉，确保党和国家事业始终沿着正确方向胜利前进。""", """一、经济正在经历艰难时刻
一个时期以来，除了大环境国际经济不景气，国内经济结束了两位数高速增长之后，开始阶段性转换，增长速度持续下行，增长速度呈阶梯式回落之势。经济增长速度阶梯式回落，使各方面压力加大，相当多的企业经营困难甚至倒闭，部分地区经济下滑严重，一些省份财政收入急降、失业问题突出，股市大幅动荡，地方政府债务风险升高。从统计数据看，我国经济下行压力加大主要从以下几个方面体现出来，一是三大需求同时收缩；二是工业生产继续回落；三是产能过剩问题依然突出；四是部分地区困难凸显。
二、在经济下行中有亮点
从高速增长到中高速增长，表明我国经济增长进入“新常态”。经济下行确实给我们带来前所未有的压力。压力当前，但也不乏亮点。一是产业结构加速升级，第三产业增长增速较快；二是消费对经济增长的贡献率明显上升，目前最终消费支出的贡献率达到60%，这说明我国经济增长的动力结构在加速调整，消费的基础性作用不断强化；三是新市场主体继续快速增加。在经济下行压力下，尽管有些企业经营困难甚至倒闭，但又不断有企业新生，实际上企业生生死死是市场经济竞争规律发挥作用的体现；四是能源消耗进一步下降。降低消耗、减少污染是转变经济发展方式重要内容，是经济运行效益提高的重要体现；五是城乡居民收入差距进一步缩小。城乡居民平均收入增长经济增速，说明城乡居民的平均收入增幅相对稳定。
三、“三期叠加”下寻找和把握经济发展机会
我国正在经历经济增长换挡期、结构调整阵痛期和前期刺激政策消化期“三期叠加”的困难。所谓换挡，就是从高挡换到中高挡，减速成为必然；结构调整，意味着产能过剩行业收缩；前期刺激政策消化，意味着刺激政策的累积效应和溢出效应还在发生作用，使经济结构调整难度加大，当期宏观政策的选择运用受到掣肘。“三期叠加”矛盾交织，对我国经济增长目标的实现形成制约。还有，当前议论比较多的一个问题就是“为官不为”。在我国现阶段，由于相关制度不配套不完善，在守规矩守纪律要求越来越严的大背景下，的确出现一些官员怕犯错误，不求有功但求无过，在招商引资、促进经济发展方面缩手缩脚，积极性主动性下降的情况。近年来对GDP增长指标考核力度减弱，部分区域和县域取消GDP考核，也对地方经济增长形成一定的客观影响。同时，还要看到，经济下行往往会惯性发生作用。
但分析经济形势不能只看一面，看不到困难就找不到政策着力点，只看困难看不到亮点则容易丧失信心。对经济形势有利条件是，近年来陆续出台的稳增长政策的效应会逐步显现；国家批准的重大工程项目会陆续展开投资并产生相应的经济带动作用；经济运行中的新趋势新亮点会得到强化；基期年度经济增长速度放缓，意味着新的经济年度增长基数相对低。只要决策者能审时度势，仍然把中心放在经济建设上，调动一切积极因素，加强和改善宏观调控措施得当，同时加快推进体制改革，扩大“改革红利”，把有利条件变成实际的增长速度是可能的。 """, """1、建设“一带一路”，是以习同志为总，书，记的党，中，央主动应对全球形势深刻变化、统筹国内国际两个大局作出的重大战略决策。
它对推进我国新一轮对外开放和沿线国家共同发展意义重大。当前，经济全球化深入发展，区域经济一体化加快推进，全球增长和贸易、投资格局正在酝酿深刻调整，亚欧国家都处于经济转型升级的关键阶段，需要进一步激发域内发展活力与合作潜力。“一带一路”战略构想的提出，契合沿线国家的共同需求，为沿线国家优势互补、开放发展开启了新的机遇之窗。
“一带一路”在平等的文化认同框架下谈合作，是国家的战略性决策，体现的是和平、交流、理解、包容、合作、共赢的精神。
随着中国成为世界第二大经济体，国际社会上 “中国威胁论”的声音不绝于耳。“一带一路”的建设，正是中国在向世界各国释疑解惑，向世界宣告和平崛起：中国崛起不以损害别国的利益为代价。
2、“一带一路”沿线大多是新兴经济体和发展中国家，总人口约44亿，经济总量约21万亿美元，分别约占全球的63%和29%。这些国家普遍处于经济发展的上升期，开展互利合作的前景广阔。深挖我国与沿线国家的合作潜力，必将提升新兴经济体和发展中国家在我国对外开放格局中的地位，促进我国中西部地区和沿边地区对外开放，推动东部沿海地区开放型经济率先转型升级，进而形成海陆统筹、东西互济、面向全球的开放新格局。
中国经济的发展，是一个不断开拓创新和寻求突破的过程，从沿海地区向西部内陆不断推进，“一带一路”建设将为全面深化改革和持续发展创造前提条件，在区域合作新格局中寻找未来发展的着力点和突破口，可谓是“一子落而满盘活”。
在中国国内近年实行西部大开发战略的形势下，中国和中亚乃至向西更多国家的经贸合作也成为发展的必然趋势。而中国的发展经验和成果，可以为中亚等各国借鉴。公路、铁路、油气管道、网络通信设施等不断修建，正在形成古丝绸之路上的现代商队。

3、打开世界地图可以发现，“一带一路”这条世界上跨度最长的经济大走廊，发端于中国，贯通中亚、东南亚、南亚、西亚乃至欧洲部分区域，东牵亚太经济圈，西系欧洲经济圈。它是世界上最具发展潜力的经济带，无论是从发展经济、改善民生，还是从应对金融危机、加快转型升级的角度看，沿线各国的前途命运，从未像今天这样紧密相连、休戚与共。
“一带一路”不仅是实现中华民族振兴的战略构想，更是沿线各国的共同事业，有利于将政治互信、地缘毗邻、经济互补等优势转化为务实合作、持续增长优势。
通过“一带一路”建设，无论是“东出海”还是“西挺进”，都将使我国与周边国家形成“五通”。“一带一路”战略合作中，经贸合作是基石。遵循和平合作、开放包容、互学互鉴、互利共赢的丝路精神，中国与沿线各国在交通基础设施、贸易与投资、能源合作、区域一体化、人民币国际化等领域，必将迎来一个共创共享的新时代。

4、“一带一路”是开放包容的经济合作倡议，不限国别范围，不是一个实体，不搞封闭机制，有意愿的国家和经济体均可参与进来，成为“一带一路”的支持者、建设者和受益者。在共同建设的未来，“一带一路”无疑将释放更大的活力。
“一带一路”战略构想，正在世界各国人民心中落地生根。复兴丝绸之路，一幅横贯东西、共谋发展的宏大蓝图正在铺展开来。有梦想，有追求，有奋斗，一切都有可能。中国人民有梦想，世界各国人民有梦想，这将给世界带来无限生机和美好前景。""", """农业供给侧结构调整”和“改革”两大板块。第一个板块包括三大调整、两个支撑。
——调优产品结构，突出“优”字。消除无效供给，增加有效供给，减少低端供给，拓展高端供给，大宗农产品要突出“优质专用”，其他农产品要突出“特色优势”。一号文件提出，要统筹粮经饲种植结构，发展规模高效养殖业，做大做强优势特色产业。
——调好生产方式，突出“绿”字。推行绿色生产方式，修复治理生态环境，既还历史旧账，也为子孙后代留生存和发展空间。一号文件提出推进农业清洁生产、大规模实施农业节水工程、集中治理农业环境突出问题等政策措施。
——调顺产业体系，突出“新”字。着力发展农村新产业新业态，促进一产二产三产深度融合，实现农业“全环节升级、全链条升值”。一号文件提出大力发展乡村休闲旅游产业、农村电商、现代食品产业等政策措施。

——强化科技支撑。就是要适应农业由量到质转变的大趋势，创新农业技术体系和技术路线。一号文件提出加强农业科技研发、强化农业科技推广、完善农业科技创新激励机制等方面政策措施。

——强化基础支撑。就是要补齐农业农村基础设施和公共服务短板，增强农业农村发展后劲。为此，一号文件强调加强农田基本建设、改善农村人居环境和扎实推进脱贫攻坚等内容。

“改革板块核心是理顺政府和市场‘两只手’关系，实现三大激活。”唐仁健表示。

激活市场。简言之就是“市场定价、价补分离”，让农产品价格主要由市场决定。去年实施玉米临时收储制度改革效果明显，全国调减玉米3000万亩，国内玉米价格逐步具备国际竞争力。一号文件提出，深化粮食等重要农产品价格形成机制和收储制度改革、完善农业补贴制度等。

激活要素。创新资源要素配置机制，唤醒农村沉睡资源。一号文件提出改革财政支农投入机制、加快农村金融创新、深化集体产权制度改革等重大政策举措。

激活主体。加快推进农业经营体系改革，激活各类人才到农业农村创新创业。我国经营面积50亩以上的经营主体已有350万户，无论是合作社、家庭农场，还是种养大户，都非常有活力。一号文件提出了一系列政策举措，培育发展新型农业经营主体和服务主体。""", """1、当前国际形势的变化：

国际局势保持总体和平、缓和与稳定态势，但局部性的战争、动荡与紧张有所加剧。
霸权主义是当今世界动荡不安的主要根源 ；国际恐怖主义反弹强烈，国际反恐斗争形势严峻；国际反恐斗争中双重标准问题反映出国际反恐阵线的内部分化倾向。 
2、当前国际形势的特点，一般概括为“一超多强，强强联合”的局面：

一超六强：即一个超级大国（美国）、六个强国（中、俄、日、英、法、德）。
强强联合：即美日同盟、美法德英的北约军事集团以及美日澳、美日韩、美与新、美与菲等军事同盟；
3、我国应对国际形势的变化的策略：
中国必须要正确把握国际形势的新发展趋势和特点，积极做到趋利避以应对国际政治经济挑战；
必须要主动参与到众多的国际新规则制定过程中来，对内来讲仍然必须要始终坚持对外开放的基本国策不动摇；
中国要抓住发展的机遇期，同时要尽力化解各方面的矛盾，从而使我国的发展顺利度过当前的利益碰撞期 ；
中国必须要大力实施科技兴国的战略，努力提升本国的科技水平，从而为我国的发展提供科技保障，为我国的进一步发展提供坚实有力的科技保障。""", """一是世界多极化更趋明朗，并导致国际格局深刻调整演变。
近年来，新兴大国的崛起、美国实力的相对下降，使世界多极化的趋势更加明显。传统大国、新兴大国之间及其内部关系出现大调整，从而推动国际格局加速演变。 
一个重要趋势是多极化从曲折前进到加快发展。美国深受一场危机和两场战争的冲击，“一超”地位动摇，单边黩武气焰有所收敛。新兴和发展中国家国际地位显著提高。与此同时，全球经济与战略重心东移。这一趋势仍在继续深化发展。 
不过，专家们同时指出，随着西方发达国家开始走出危机，国际力量对比的“东升西降”趋势放缓，美欧等发达国家温和复苏，以金砖国家为代表的新兴经济体发展遭遇困难，“大而不强”的特点突出，与此同时西方“抱团取暖”努力维持其主导地位。 
展望未来10年，“东升西降”仍将处于量变过程，世界格局仍将是一超多强，并出现多个力量中心。美国仍将是世界第一强国，将在创新、金融和军事领域保持全球领导者的地位。尽管美国对国际事务的主导能力呈下降趋势，但其主导地位发生根本改变需要更长时间。在国际格局的过渡时期，伴随着的将是国际以及各国国内的不稳定因素增多。 
二是经济全球化深入发展，并导致世界各国相互依存加深。
经济全球化是一柄“双刃剑”，对一些国家而言既是机遇，也是挑战，特别是对经济实力薄弱和科学技术比较落后的发展中国家来说，它们将面对全球性的激烈竞争，所遇到的风险、挑战将更加严峻。   一个重要趋势是全球化从西方主导变为西方失势，全球治理中的“南升北降”明显。八国集团日渐式微，北方国家或发达国家在世界银行、国际货币基金组织中的优势受到一定程度的削弱。金砖国家、二十国集团地位在这一过程中凸显。这一点仍在继续发展。 多名专家还指出了全球化同时有放缓的趋势。中国现代国际关系研究院副院长、研究员傅梦孜从三个方面为记者做了分析，首先是上个世纪90年代美国引领和主导了经济全球化，但近年来特别是全球金融危机以来，美国缺乏继续推动全球化的意愿以及能力，奥巴马政府实施再工业化战略、发起能源革命，以及经常出现的贸易保护主义措施等，就是例证；其次是现在全球贸易额每年高达30多万亿美元，靠某个国家推动变得越来越困难，而且各国的技术优势也不再像从前那样明显；最后，各大力量纷纷兴起后，更多地考虑本国、本地区的利益得失，在全球范围内的谈判困难很大。当然，区域内、集团内或双边的谈判正在进行中的多达几百个，也都遭遇这样那样的困难。   “在全球化时代，各国相互依存加深，愈发形成利益与命运共同体。在相互关系日益密切的同时，相互间的矛盾和摩擦也会趋向尖锐化。”中国国际问题研究所战略部主任、研究员陈须隆说。   
三是传统安全与非传统安全问题交织，并导致国际安全挑战更加复杂多样。 
在传统安全领域，国家内部、国家之间的矛盾和冲突难以消除。军备竞赛难以控制，采用武力解决争端的风险依然存在。在传统安全问题无法消除的同时，非传统安全挑战不断发酵。 
一个重要趋势是安全威胁从传统领域向非传统领域扩散，西方新干涉主义危害凸显。西方国家策动颜色革命、搞政权更迭、武力干涉一国内部事务，仍是对地区和世界和平的主要威胁。与此同时，恐怖主义、气候变化、能源资源等问题日益凸显，国际挑战更趋多元化。这给全球治理提出了更高要求，而治理难度继续增大。 
“当前人类面临的非传统安全威胁前所未有，无论是环境、气候变化还是恐怖主义威胁，都使人类未来生存和生活受到威胁，而总体上国际社会应对不力。因此，需要国际上特别是大国在国际合作方式、路径选择、采取手段等方面担负更多责任，展现更大诚意。”国防大学战略部教授王宝付如是说。 
四是互联网与信息技术迅猛发展，人类社会与经济生活由现实世界转入现实与虚拟两个世界，两个世界既迥然不同，又紧密相关；网络空间的军事化、政治化趋势明显，国际博弈加剧。一个重要趋势是各国更加从战略上重视网络与信息安全，纷纷制定本国网络安全战略，同时在国际上争夺网络规则制定权。 
五是文化多样化持续推进，并导致价值观念与发展道路的交锋交流同步上升。
文化多样化是一种客观存在，是一种发展要求，文化多样化持续推进。一个重要趋势是各国增强文化自觉和文化自信，同时积极维护和促进世界文化多样化，并在这一过程中不断发扬光大本国本民族的文化。 
六是社会信息化加速发展，并深刻影响人类社会发展进程。
社会信息化的发展创造着新的经济活动形态、新的社会管理模式、新的生活方式，使得人们的社会生活水平和生活质量得到改变，并推动了社会进步，同时也给国家安全带来新的挑战。一个重要的趋势是新的信息技术应用将给人类生活一系列领域带来新的巨大变化。   合作、发展主流大势未变 
受访专家认为，世界形势复杂变化，但和平、发展、合作的主流大势未变。但在世界处于格局演变的重要阶段，会呈现出一些不同于以往的新动向。""", """为了学习贯彻党的十九大精神，使十九大精神真正成为推动党和国家事业发展的强大思想武器，中央人民广播电台中国之声从今天（6日）起推出系列报道《十九大报告权威访谈》，邀请不同领域的专家学者和权威人士深度解读报告，今天（6日）播出第一篇：《时代先声——习近平新时代中国特色社会主义思想》。
习近平新时代中国特色社会主义思想内容丰富，方向清晰。中央党史研究室副主任冯俊说，这一思想的精神实质就表现在“八个明确”和“十四个坚持”中，“八个明确”是十八大以来，以习近平同志为核心的党中央在理论创新、实践创新方面最新的理论成果。它是习近平新时代中国特色社会主义思想的基本内涵、四梁八柱、核心要义，“第一个明确，坚持和发展中国特色社会主义，总任务是实现社会主义现代化和中华民族伟大复兴，在全面建成小康社会的基础上，分两步走，到本世纪中叶，建成富强民主文明和谐美丽的社会主义现代化国家。第二个明确是十九大提出的，新时代我国社会主义的主要矛盾发生了变化，人民日益增长的美好生活需要和不平衡不充分发展之间的矛盾，顺应这个新的变化，要确立以人民为中心的发展理念，要促进人的全面发展，全体人民共同富裕。”
第三个明确，是中国特色社会主义事业的“五位一体”总体布局和“四个全面”的战略布局，以及包括中国特色社会主义的道路自信、理论自信、制度自信和文化自信在内的“四个自信”。第四个明确，是全面深化改革总目标，发展和完善中国特色社会主义制度，推进国家治理体系和治理能力的现代化。冯俊介绍：“第五个明确，是要全面推进依法治国总目标，建设中国特色社会主义的法制体系，建设社会主义的法治国家。第六个明确，是要实现强军的目标是建设一支听党指挥、能打胜仗、作风优良的人民军队，把人民军队建设成世界一流的军队。第七是明确中国特色大国外交，要推动构建新型国际关系，推动构建人类命运共同体。”
最后一个明确讲的是，中国特色社会主义制度的最大优势是中国共产党的领导，党是最高的政治领导力量。冯俊认为，十九大提出的新时代党的建设的总要求，是党的建设理论的一个创新点，突出党的政治、党的建设的作用。而这‘八个明确’放在一起，形成了一个系统完整、逻辑严密、相互贯通的科学理论体系，“‘八个明确’放在一起是紧紧围绕坚持和发展中国特色社会主义这个鲜明的主题，提出了一系列新理念新思想新战略，涉及生产力与生产关系，经济基础与上层建筑的各种关系，涵盖了经济建设、政治建设、文化建设、社会建设、生态文明建设以及国防、外交、党的建设各个领域。”
“八个明确”确立了一种新时期最高层次的理论，它和“十四个坚持”形成了对应的关系。两者相辅相成，不可分割，简单来说是“八个明确”提出了“是什么”的问题，而“十四个坚持”解决了“怎么办”的问题。冯俊认为：“‘十四个坚持’是讲行动纲领、基本方略，怎么把‘八个明确’落到实处，怎么把‘八个明确’在实践中加以实行，在实践中要有抓手，把‘八个明确’做下去只有通过‘十四个坚持’才能够实现。”
习近平新时代中国特色社会主义思想是对马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观的继承和发展。在冯俊眼中，这一思想除了显示了继承性，是中国特色社会主义理论体系的重要组成部份，更强调了创新性，是党和人民实践经验和集体智慧的结晶，无论在近百年的中国共产党发展史上，还是在近半个世纪的中国特色社会主义发展史上，都具有重要而深远的历史意义和现实意义，“习近平同志以一个马克思主义政治家理论家的深刻的洞察力，敏锐的判断力和战略定力，十八大以来，他提出了一系列的新理念新思想新战略，就为习近平新时代中国特色社会主义理论的创立，发挥了决定性的作用，做出了决定性的贡献。”
习近平新时代中国特色社会主义思想，吸引着想要透过中国找寻未来方向的世界目光，同时，在马克思主义中国化的进程中，它有着明确的时代意义和时代特色，是这个时代的产物，是马克思主义中国化的最新成果。冯俊表示：“这个最新成果表明它与时代结合得最紧密，是最前沿、最新的东西，和改革开放以来我们所说的中国特色社会主义理论体系相衔接，同时又和中国特色社会主义进入新时代相呼应，符合党的共同意愿。”
经过30多年的改革开放，我国十几亿人解决了温饱问题，在民主、法治、公平、正义、安全、环境等方面的要求日益增长，社会生产力水平显著提高，综合国力显著增强，发展不平衡不充分的问题更加突出，国际格局风云变幻，“中等收入陷阱”、“修昔底德陷阱”的内外困扰叠加出现……
面对这道复杂难解的方程式，以习近平同志为核心的党中央增强政治定力、坚定理论自信，以高远的历史站位、宽广的世界眼光，写就了习近平新时代中国特色社会主义思想的崭新篇章。冯俊说：“习近平新时代中国特色社会主义思想，以其新的历史站位、宏阔的视野和战略眼光，反映了时代发展的丰富内涵，回应了实践的要求，这个思想要成为我们新时代推进党和国家各项事业的思想指南或者行动纲领。”"""]

from selenium import webdriver
from time import sleep
def auto_complete(xh,p=None):
    b=webdriver.Firefox()
    b.get("http://itrc.jju.edu.cn/netedu/sso/sso.jsf")
    usernm = b.find_element_by_css_selector("input#username")
    usernm.clear()
    usernm.send_keys(xh)
    passwd = b.find_element_by_css_selector("input#password")
    passwd.clear()
    if not p:
        p=xh[-6:]
    passwd.send_keys(p)
    login = b.find_element_by_css_selector("input#btlogin")
    login.click()
    into = b.find_element_by_css_selector("tr.odd > td > a")
    into.click()
    b.get("http://itrc.jju.edu.cn/netedu/stu/homework/homework.jsf")
    timus = b.find_elements_by_css_selector("table.table-background > tbody > tr > td > a")
    for i in range(len(daan)):
        timus[i*2].click()
        f = b.find_elements_by_css_selector("iframe.ke-iframe")
        b.switch_to_frame(f[1])
        kongbai = b.find_element_by_css_selector("body.ke-content")
        kongbai.click()
        if len(b.page_source)<400:
            kongbai.send_keys(daan[i])
        b.switch_to_default_content()
        submit = b.find_element_by_css_selector("form > div > input")
        submit.location_once_scrolled_into_view
        submit.click()
        timus = b.find_elements_by_css_selector("table.table-background > tbody > tr > td > a")
        i+=1
    b.close()
def a():
    import xlrd
    book = xlrd.open_workbook("1.xls")
    table = book.sheets()[0]
    a = table.col_values(1)
    a.pop(0)
    a.pop(0)
    for i in a:
        print (i)
        try:
            auto_complete(i)
        except Exception as e:
            print("出错")
            pass

# a()
auto_complete("11316010236")
